HomeWork-3/reports/128M/withoutIndex/wrk2-R1000.txt
Running 5m test @ http://localhost:5000
  8 threads and 500 connections
  Thread calibration: mean lat.: 8987.648ms, rate sampling interval: 20070ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 6326.442ms, rate sampling interval: 20447ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 8612.864ms, rate sampling interval: 20430ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.55m     1.25m    4.95m    51.37%
    Req/Sec     0.88     33.83     3.64k    99.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.61m 
 75.000%    3.82m 
 90.000%    3.99m 
 99.000%    4.87m 
 99.900%    4.95m 
 99.990%    4.95m 
 99.999%    4.95m 
100.000%    4.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10182.655     0.000000            1         1.00
   60030.975     0.100000          243         1.11
   61046.783     0.200000          489         1.25
  117047.295     0.300000          657         1.43
  119668.735     0.400000          886         1.67
  156368.895     0.500000         1094         2.00
  179044.351     0.550000         1209         2.22
  179175.423     0.600000         1382         2.50
  180092.927     0.650000         1481         2.86
  203685.887     0.700000         1533         3.33
  229244.927     0.750000         1642         4.00
  238551.039     0.775000         1707         4.44
  238682.111     0.800000         1878         5.00
  238682.111     0.825000         1878         5.71
  238682.111     0.850000         1878         6.67
  239599.615     0.875000         1977         8.00
  239599.615     0.887500         1977         8.89
  239599.615     0.900000         1977        10.00
  249430.015     0.912500         1997        11.43
  259391.487     0.925000         2024        13.33
  265945.087     0.937500         2052        16.00
  268304.383     0.943750         2065        17.78
  270270.463     0.950000         2082        20.00
  274726.911     0.956250         2093        22.86
  278134.783     0.962500         2107        26.67
  280494.079     0.968750         2123        32.00
  282591.231     0.971875         2127        35.56
  284950.527     0.975000         2135        40.00
  286523.391     0.978125         2141        45.71
  288620.543     0.981250         2147        53.33
  289406.975     0.984375         2154        64.00
  290193.407     0.985938         2158        71.11
  290979.839     0.987500         2161        80.00
  292028.415     0.989062         2165        91.43
  292290.559     0.990625         2168       106.67
  293076.991     0.992188         2171       128.00
  293863.423     0.992969         2173       142.22
  294125.567     0.993750         2175       160.00
  294911.999     0.994531         2177       182.86
  295174.143     0.995313         2179       213.33
  295436.287     0.996094         2182       256.00
  295436.287     0.996484         2182       284.44
  295436.287     0.996875         2182       320.00
  295698.431     0.997266         2184       365.71
  295698.431     0.997656         2184       426.67
  295698.431     0.998047         2184       512.00
  296484.863     0.998242         2185       568.89
  296484.863     0.998437         2185       640.00
  296747.007     0.998633         2186       731.43
  296747.007     0.998828         2186       853.33
  296747.007     0.999023         2186      1024.00
  297009.151     0.999121         2188      1137.78
  297009.151     1.000000         2188          inf
#[Mean    =   153283.801, StdDeviation   =    74966.621]
#[Max     =   296747.008, Total count    =         2188]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    1.00m 
 75.000%    1.00m 
 90.000%    1.00m 
 99.000%    1.00m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10182.655     0.000000            1         1.00
   53936.127     0.100000          219         1.11
   60030.975     0.200000         1959         1.25
   60030.975     0.300000         1959         1.43
   60030.975     0.400000         1959         1.67
   60030.975     0.500000         1959         2.00
   60030.975     0.550000         1959         2.22
   60030.975     0.600000         1959         2.50
   60030.975     0.650000         1959         2.86
   60030.975     0.700000         1959         3.33
   60030.975     0.750000         1959         4.00
   60030.975     0.775000         1959         4.44
   60030.975     0.800000         1959         5.00
   60030.975     0.825000         1959         5.71
   60030.975     0.850000         1959         6.67
   60030.975     0.875000         1959         8.00
   60030.975     0.887500         1959         8.89
   60063.743     0.900000         2092        10.00
   60063.743     0.912500         2092        11.43
   60063.743     0.925000         2092        13.33
   60063.743     0.937500         2092        16.00
   60063.743     0.943750         2092        17.78
   60063.743     0.950000         2092        20.00
   60096.511     0.956250         2185        22.86
   60096.511     0.962500         2185        26.67
   60096.511     0.968750         2185        32.00
   60096.511     0.971875         2185        35.56
   60096.511     0.975000         2185        40.00
   60096.511     0.978125         2185        45.71
   60096.511     0.981250         2185        53.33
   60096.511     0.984375         2185        64.00
   60096.511     0.985938         2185        71.11
   60096.511     0.987500         2185        80.00
   60096.511     0.989062         2185        91.43
   60096.511     0.990625         2185       106.67
   60096.511     0.992188         2185       128.00
   60096.511     0.992969         2185       142.22
   60096.511     0.993750         2185       160.00
   60096.511     0.994531         2185       182.86
   60096.511     0.995313         2185       213.33
   60096.511     0.996094         2185       256.00
   60096.511     0.996484         2185       284.44
   60096.511     0.996875         2185       320.00
   60096.511     0.997266         2185       365.71
   60096.511     0.997656         2185       426.67
   60096.511     0.998047         2185       512.00
   60096.511     0.998242         2185       568.89
   60096.511     0.998437         2185       640.00
   60129.279     0.998633         2188       731.43
   60129.279     1.000000         2188          inf
#[Mean    =    57696.157, StdDeviation   =     7614.361]
#[Max     =    60096.512, Total count    =         2188]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2200 requests in 5.01m, 0.93MB read
  Socket errors: connect 0, read 0, write 0, timeout 35151
Requests/sec:      7.33
Transfer/sec:      3.16KB